app/views/task_mailer/weekly_mail.html.erb

<% @total_hours = 0 %>
<% @tasks = Task.find(:all,:conditions=>{:acceptor => User.current.lastname}) %>
<% @tasks.each do |ts| %>
	<% ts.logs.each do |log| %>
---
SELECT `tasks`.* FROM `tasks` WHERE `tasks`.`acceptor` = 'nr'
SELECT `users`.* FROM `users` WHERE `users`.`type` IN ('User', 'AnonymousUser') AND `users`.`id` = ? AND (users.status = 1) LIMIT 1  [["id", 3]]
SELECT `logs`.* FROM `logs` WHERE `logs`.`task_id` = 2