app/views/tasks/_form.html.erb

SELECT `users`.* FROM `users` WHERE `users`.`type` IN ('User', 'AnonymousUser') AND `users`.`id` = ? AND (users.status = 1) LIMIT 1  [["id", 3]]
---
    <td id="tdleft"><%#= f.label :acceptor %></td>
	<td><%#= f.select :acceptor, User.find(:all, :conditions =>"lastname= Admin").collect{|p|[p.lastname]},  {:include_blank => 'select'} %></td></tr>