app/views/projects/settings/_members.html.erb

SELECT `member_roles`.* FROM `member_roles` WHERE `member_roles`.`member_id` = 1
---
        <p><% roles.each do |role| %>
        <label><%= check_box_tag 'membership[role_ids][]', role.id, member.roles.include?(role),
                                                       :disabled => member.member_roles.detect {|mr| mr.role_id == role.id && !mr.inherited_from.nil?} %> <%=h role %></label><br />