app/views/stories/show.html.erb

SELECT `projects`.* FROM `projects` WHERE `projects`.`id` = ? LIMIT 1  [["id", "1"]]
---
				<td >
					<% pro = Project.find(params[:project_id]) %>