app/controllers/iterations_controller.rb

def new
    @project = Project.find(params[:project_id])
---
SELECT `projects`.* FROM `projects` WHERE `projects`.`id` = ? LIMIT 1  [["id", "1"]]

def edit
    @project = Project.find(params[:project_id])
    @iteration = @project.iteration.find(params[:id])
---
SELECT `projects`.* FROM `projects` WHERE `projects`.`id` = ? LIMIT 1  [["id", "1"]]
SELECT `iterations`.* FROM `iterations` WHERE `iterations`.`project_id` = 1 AND `iterations`.`id` = ? LIMIT 1  [["id", "1"]]

def create
	  @project = Project.find(params[:project_id])
		 @iteration = @project.iteration.new(params[:iteration])

	if @iteration.status == "Open"
		@all_iterations = Iteration.find(:all, :select => "status" ,:conditions => {:status => "Open", :project_id => @project.id}).map(&:status).count
	#raise @all_iterations.inspect
	if @all_iterations >= 1
		flash[:error] ="one iteration is already opened. please select planned"
		redirect_to new_project_iteration_path(@project.id) and return
	else
		@all_enddates = Iteration.find(:all, :select => "end_date" ,:conditions => {:project_id => @project.id}).map(&:end_date)
	if @all_enddates == []
		@iteration.save
---
SELECT end_date FROM `iterations` WHERE `iterations`.`project_id` = 1
INSERT INTO `iterations` (`created_at`, `description`, `end_date`, `iterationtype`, `name`, `project_id`, `start_date`, `status`, `updated_at`) VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)

def update
   @project = Project.find(params[:project_id])
   @iteration = @project.iteration.find(params[:id])

   if @iteration.update_attributes(params[:iteration])
---
SELECT `projects`.* FROM `projects` WHERE `projects`.`id` = ? LIMIT 1  [["id", "1"]]
SELECT `iterations`.* FROM `iterations` WHERE `iterations`.`project_id` = 1 AND `iterations`.`id` = ? LIMIT 1  [["id", "1"]]
UPDATE `iterations` SET `name` = 'asdfa ads', `updated_at` = '2012-10-26 15:00:01' WHERE `iterations`.`id` = 1

def show
    @project = Project.find(params[:project_id])
    @iteration = @project.iteration.find(params[:id])
    @iterationpagination = @iteration.story.paginate(:page => params[:page], :per_page => 8)
---
SELECT `projects`.* FROM `projects` WHERE `projects`.`id` = ? LIMIT 1  [["id", "1"]]
SELECT `iterations`.* FROM `iterations` WHERE `iterations`.`project_id` = 1 AND `iterations`.`id` = ? LIMIT 1  [["id", "1"]]
SELECT `iterations`.* FROM `iterations`
SELECT `stories`.* FROM `stories` WHERE `stories`.`iteration_id` = 1 LIMIT 8 OFFSET 0

def deleteiteration
	#raise params.inspect
    @project_id = params[:project_id]
    @it_id = params[:id]
    @story_id = params[:format]
   @story = Story.find(@story_id)

   @story.destroy
---
SELECT `stories`.* FROM `stories` WHERE `stories`.`id` = ? LIMIT 1  [["id", "1"]]
DELETE FROM `stories` WHERE `stories`.`id` = ?  [["id", 3]]