app/controllers/iterations_controller.rb

SELECT `iterations`.* FROM `iterations` WHERE `iterations`.`id` = ? LIMIT 1  [["id", "1"]]
DELETE FROM `iterations` WHERE `iterations`.`id` = ?  [["id", 1]]
---
def deleteiteration
    @project_id = params[:project_id]
    @it_id = params[:id]
   @iteration = Iteration.find(@it_id )
   @iteration.destroy