app/controllers/my_controller.rb

SELECT `users`.* FROM `users` WHERE `users`.`type` IN ('User', 'AnonymousUser') AND `users`.`id` = ? AND (users.status = 1) LIMIT 1  [["id", 1]]
SELECT `members`.* FROM `members` WHERE `members`.`user_id` = 1
---
  def page
$date = Time.now
@day = $date.wday
if @day.to_i == 4
	@user = User.current.id
	@us = User.find(@user)
	usermail = @us
	#TaskMailer.weekly_mail.deliver
end
    @user = User.current
   # @project = Project.find(params[:project_id])
    @blocks = @user.pref[:my_page_layout] || DEFAULT_LAYOUT
    @projects = Project.find(:all)
 @user = User.current
@pro_arrays = Array.new
@member = Member.find(:all, :conditions => {:user_id => @user })

SELECT `tasks`.* FROM `tasks` WHERE `tasks`.`acceptor` = 'nr'
SELECT `users`.* FROM `users` WHERE `users`.`type` IN ('User', 'AnonymousUser') AND `users`.`id` = ? AND (users.status = 1) LIMIT 1  [["id", 3]]
---
def mytimesheet
@start = params[:start_date]
@end = params[:end_date]
@user = User.current.lastname
@tasks_new = Task.find(:all,:conditions=>{:acceptor=>@user})