app/controllers/stories_controller.rb

def new

 @iteration = Iteration.find(params[:iteration_id])
---
SELECT `iterations`.* FROM `iterations` WHERE `iterations`.`id` = ? LIMIT 1  [["id", "1"]]

def create
	@project = Project.find(params[:project_id])
	 @iteration = Iteration.find(params[:iteration_id])
      @story = @iteration.story.create(params[:story])
---
SELECT `projects`.* FROM `projects` WHERE `projects`.`id` = ? LIMIT 1  [["id", "1"]]
SELECT `iterations`.* FROM `iterations` WHERE `iterations`.`id` = ? LIMIT 1  [["id", "1"]]
INSERT INTO `stories` (`Estimated_hours`, `Type`, `created_at`, `customer`, `description`, `disposition`, `estimation_time`, `issue_id`, `iteration_id`, `name`, `order`, `order_cust`, `priority`, `status`, `tracker`, `updated_at`) VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

def show
	@project = Project.find(params[:project_id])
	@iteration = Iteration.find(params[:iteration_id])
	@story = @iteration.story.find(params[:id])
	@paginatestory = @story.tasks.paginate(:page => params[:page], :per_page => 8)
---
SELECT `projects`.* FROM `projects` WHERE `projects`.`id` = ? LIMIT 1  [["id", "1"]]
SELECT `iterations`.* FROM `iterations` WHERE `iterations`.`id` = ? LIMIT 1  [["id", "1"]]
SELECT `stories`.* FROM `stories` WHERE `stories`.`iteration_id` = 1 AND `stories`.`id` = ? LIMIT 1  [["id", "1"]]
SELECT `tasks`.* FROM `tasks` WHERE `tasks`.`story_id` = 1 LIMIT 8 OFFSET 0

def edit
   @project = Project.find(params[:project_id])
    @iteration = @project.iteration.find(params[:iteration_id])
    @story = @iteration.story.find(params[:id])
---
SELECT `projects`.* FROM `projects` WHERE `projects`.`id` = ? LIMIT 1  [["id", "1"]]
SELECT `iterations`.* FROM `iterations` WHERE `iterations`.`project_id` = 1 AND `iterations`.`id` = ? LIMIT 1  [["id", "1"]]
SELECT `stories`.* FROM `stories` WHERE `stories`.`iteration_id` = 1 AND `stories`.`id` = ? LIMIT 1  [["id", "1"]]

def update
   @project = Project.find(params[:project_id])
    @iteration = @project.iteration.find(params[:iteration_id])
    @story = @iteration.story.find(params[:id])

    if @story.update_attributes(params[:story])
---
SELECT `projects`.* FROM `projects` WHERE `projects`.`id` = ? LIMIT 1  [["id", "1"]]
SELECT `iterations`.* FROM `iterations` WHERE `iterations`.`project_id` = 1 AND `iterations`.`id` = ? LIMIT 1  [["id", "1"]]
SELECT `stories`.* FROM `stories` WHERE `stories`.`iteration_id` = 1 AND `stories`.`id` = ? LIMIT 1  [["id", "3"]]
UPDATE `stories` SET `name` = 'ramu', `updated_at` = '2012-10-26 14:46:24' WHERE `stories`.`id` = 3

  def deletestory
 @project_id = params[:project_id]
 @iteration_id = params[:iteration_id]
 @story_id = params[:story_id]
  @story = Story.find(@story_id)
	#raise @story.inspect
	@story.destroy
---
SELECT `stories`.* FROM `stories` WHERE `stories`.`id` = ? LIMIT 1  [["id", "1"]]
DELETE FROM `stories` WHERE `stories`.`id` = ?  [["id", 1]]