app/controllers/tasks_controller.rb

SELECT `stories`.* FROM `stories` WHERE `stories`.`id` = ? LIMIT 1  [["id", "1"]]
---
def new
 @story = Story.find(params[:story_id])

SELECT `projects`.* FROM `projects` WHERE `projects`.`id` = ? LIMIT 1  [["id", "1"]]
SELECT `iterations`.* FROM `iterations` WHERE `iterations`.`id` = ? LIMIT 1  [["id", "1"]]
SELECT `stories`.* FROM `stories` WHERE `stories`.`id` = ? LIMIT 1  [["id", "1"]]
SELECT `users`.* FROM `users` WHERE `users`.`type` IN ('User', 'AnonymousUser') AND `users`.`id` = ? AND (users.status = 1) LIMIT 1  [["id", 3]]
INSERT INTO `tasks` (`acceptor`, `created_at`, `description`, `disposition`, `estimated_hours`, `issue_current_id`, `issue_id`, `last_mail`, `name`, `status`, `story_id`, `task_type`, `updated_at`) VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
def create
    @projectid = Project.find(params[:project_id])
	 @iterationid = Iteration.find(params[:iteration_id])
      @storyid = Story.find(params[:story_id])
    @user = User.find(:all)
    @story = Story.find(params[:story_id])
    @task = @story.tasks.new(params[:task])
    @stid = @story.name

if @task.task_type == "leave" && @task.estimated_hours > 8
 redirect_to  project_issues_path(@project) and return
 flash[:error] = "Leave is only 8 hrs to log per day"
else
	if @task.save

SELECT `tasks`.* FROM `tasks` WHERE `tasks`.`id` = ? LIMIT 1  [["id", "2"]]
INSERT INTO `logs` (`created_at`, `description`, `estimated_time`, `log_on`, `remaining_time`, `report_date`, `spent_hours`, `task_id`, `updated_at`, `user1`, `user2`) VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
def logs
     params[:spent_hours].each do |t,values|
		@task = Task.find(t)
		@values = values
		@spent = @values.values[0]
		@desc = @values.values[1]
		@date = params["gettingdate"]

			if @spent != ""

				@log = @task.logs.create(:spent_hours => @spent , :description => @desc, :report_date => @date )