app/views/my/mytimesheet.html.erb

	</tr>
	<% @tasks = Task.find(:all,:conditions=>{:acceptor=>@user}) %>
		<% @tasks.each do |t| %>
		<% @stories = Story.find(:all,:conditions=>{:id=>t.story_id}) %>
			<% @stories.each do |st| %>
               		 <% @iterations = Iteration.find(:all,:conditions=>{:id=>st.iteration_id}) %>
				 <% @iterations.each do |it| %>
				 <% @projects = Project.find(:all,:conditions=>{:id=>it.project_id}) %>
---
SELECT `tasks`.* FROM `tasks` WHERE `tasks`.`acceptor` = 'nr'
SELECT `stories`.* FROM `stories` WHERE `stories`.`id` = 3
SELECT `iterations`.* FROM `iterations` WHERE `iterations`.`id` = 1
SELECT `projects`.* FROM `projects` WHERE `projects`.`id` = 1

				<% @tasks.each do |task| %>
					<% task.logs.each do |log| %>
---
SELECT `logs`.* FROM `logs` WHERE `logs`.`task_id` = 2