app/views/my/page.html.erb

SELECT `tasks`.* FROM `tasks` WHERE `tasks`.`acceptor` = 'Admin'
SELECT `users`.* FROM `users` WHERE `users`.`type` IN ('User', 'AnonymousUser') AND `users`.`id` = ? AND (users.status = 1) LIMIT 1  [["id", 1]]
---
<%= form_tag( logs_tasks_path, :method => :post) do %>
<% @tasks = Task.find(:all, :conditions => {:acceptor => User.current.lastname}) %>

SELECT `stories`.* FROM `stories` WHERE `stories`.`id` = 3
---

          <% @user_story = Story.find(:all, :conditions => {:id => taskmain.story_id }) %>

SELECT `iterations`.* FROM `iterations` WHERE `iterations`.`id` = 1
---

		   <% @iteration = Iteration.find(:all, :conditions => {:id => st.iteration_id }) %>

SELECT `logs`.* FROM `logs` WHERE `logs`.`task_id` = 2
---
						<td width=10%><% @actual_hours = 0 %>
							     <% @log = Log.find(:all, :conditions => {:task_id => taskmain.id}) %>