app/views/layouts/base.html.erb

SELECT `users`.* FROM `users` WHERE `users`.`type` IN ('User', 'AnonymousUser')
---
<div id="top-menu"  >
 <%@user = User.find(:all)%>